Fireflyluo/CH32V208_dome/ch32v208_tmos_cdc3/bsp/src/drv_i2c.c
/**
 ******************************************************************************
 * @file    drv_i2c.c
 * @brief   I2C 驱动程序 - HAL 库风格，支持轮询、中断和 DMA 模式
 ******************************************************************************
 * @note    本文件内实现 I2C 相关的驱动代码
 *          支持 CH32V208 的 I2C1 和 I2C2
 ******************************************************************************
 */

#include "drv_i2c.h"
#include "ch32v20x_dma.h"
#include "ch32v20x_rcc.h"
#include <string.h>

/* ========================== 全局句柄定义 ========================== */

I2C_HandleTypeDef I2C1_Handle = {0};
I2C_HandleTypeDef I2C2_Handle = {0};

/* ========================== 内部常量定义 ========================== */

// 硬件配置结构体
typedef struct
{
    uint32_t scl_pin;
    uint32_t sda_pin;
    GPIO_TypeDef *gpio_port;
    uint32_t rcc_gpio_clk;
    uint32_t rcc_i2c_clk;
    uint8_t remap_config;
    uint8_t mode;
} i2c_hw_config_t;

// 硬件配置表
static const i2c_hw_config_t i2c_hw_config[] = {
    [I2C_NUM_1] = {
        .scl_pin = GPIO_Pin_6,
        .sda_pin = GPIO_Pin_7,
        .gpio_port = GPIOB,
        .rcc_gpio_clk = RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,
        .rcc_i2c_clk = RCC_APB1Periph_I2C1,
        .remap_config = 0,
        .mode = I2C1_MODE},
    [I2C_NUM_2] = {.scl_pin = GPIO_Pin_10, .sda_pin = GPIO_Pin_11, .gpio_port = GPIOB, .rcc_gpio_clk = RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO, .rcc_i2c_clk = RCC_APB1Periph_I2C2, .remap_config = 0, .mode = I2C2_MODE}};

// 获取句柄指针
static inline I2C_HandleTypeDef *get_handle(i2c_num_t i2c_num)
{
    return (i2c_num == I2C_NUM_1) ? &I2C1_Handle : &I2C2_Handle;
}

// 获取外设指针
static inline I2C_TypeDef *get_periph(i2c_num_t i2c_num)
{
    return (i2c_num == I2C_NUM_1) ? I2C1 : I2C2;
}

static void i2c_recover_bus(i2c_num_t i2c_num);

/* ========================== 内部辅助函数 ========================== */

/**
 * @brief 等待标志位（带超时）
 */
static int wait_flag(I2C_TypeDef *i2c, uint32_t flag, FlagStatus status, uint32_t timeout)
{
    while (I2C_GetFlagStatus(i2c, flag) != status)
    {
        if (timeout-- == 0)
            return I2C_ERR_TIMEOUT;
    }
    return I2C_OK;
}

/**
 * @brief 等待事件（带超时）
 */
static int wait_event(I2C_TypeDef *i2c, uint32_t event, uint32_t timeout)
{
    while (!I2C_CheckEvent(i2c, event))
    {
        if (timeout-- == 0)
            return I2C_ERR_TIMEOUT;
    }
    return I2C_OK;
}

/**
 * @brief 错误处理
 */
static void i2c_error_handler(I2C_HandleTypeDef *hi2c, uint32_t error_code)
{
    i2c_num_t num = (hi2c->Instance == I2C1) ? I2C_NUM_1 : I2C_NUM_2;
    hi2c->ErrorCode = error_code;

    // 生成 STOP 条件
    I2C_GenerateSTOP(hi2c->Instance, ENABLE);
    I2C_AcknowledgeConfig(hi2c->Instance, ENABLE);
    I2C_ITConfig(hi2c->Instance, I2C_IT_BUF, DISABLE);
    hi2c->State = I2C_STATE_IDLE;

    // AF/BERR/ARLO 发生时主动执行总线恢复，避免 SCL 被拉低卡死
    if (error_code == I2C_ERR_AF || error_code == I2C_ERR_BERR || error_code == I2C_ERR_ARLO || error_code == I2C_ERR_TIMEOUT)
    {
        i2c_recover_bus(num);
    }

    // 调用错误回调
    if (hi2c->ErrorCallback)
    {
        hi2c->ErrorCallback(num, error_code);
    }
}

/**
 * @brief 软件复位 I2C
 */
static void i2c_sw_reset(i2c_num_t i2c_num)
{
    I2C_TypeDef *i2c = get_periph(i2c_num);
    const i2c_hw_config_t *hw = &i2c_hw_config[i2c_num];

    // 1. 禁用 I2C 和中断
    I2C_ITConfig(i2c, I2C_IT_BUF | I2C_IT_EVT | I2C_IT_ERR, DISABLE);
    I2C_Cmd(i2c, DISABLE);

    // 2. 将引脚配置为 GPIO 输出
    GPIO_InitTypeDef gpio_init = {0};
    RCC_APB2PeriphClockCmd(hw->rcc_gpio_clk, ENABLE);
    gpio_init.GPIO_Pin = hw->scl_pin | hw->sda_pin;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init.GPIO_Mode = GPIO_Mode_Out_OD;
    GPIO_Init(hw->gpio_port, &gpio_init);

    // 3. 生成 9 个时钟脉冲
    for (int i = 0; i < 9; i++)
    {
        GPIO_ResetBits(hw->gpio_port, hw->scl_pin);
        Delay_Us(5);
        GPIO_SetBits(hw->gpio_port, hw->scl_pin);
        Delay_Us(5);
    }

    // 4. 生成 STOP 条件
    GPIO_ResetBits(hw->gpio_port, hw->sda_pin);
    Delay_Us(5);
    GPIO_SetBits(hw->gpio_port, hw->scl_pin);
    Delay_Us(5);
    GPIO_SetBits(hw->gpio_port, hw->sda_pin);
    Delay_Us(10);

    // 5. 恢复 I2C 功能
    gpio_init.GPIO_Mode = GPIO_Mode_AF_OD;
    GPIO_Init(hw->gpio_port, &gpio_init);

    I2C_DeInit(i2c);
    I2C_Cmd(i2c, ENABLE);

    if (get_handle(i2c_num)->Mode == I2C_MODE_IT || get_handle(i2c_num)->Mode == I2C_MODE_DMA)
    {
        I2C_ITConfig(i2c, I2C_IT_EVT | I2C_IT_ERR, ENABLE);
        I2C_ITConfig(i2c, I2C_IT_BUF, DISABLE);
    }
}

static void i2c_recover_bus(i2c_num_t i2c_num)
{
#if (COMM_RECOVER_MODE == MODULE_SELF_RESET)
    i2c_sw_reset(i2c_num);
#elif (COMM_RECOVER_MODE == MODULE_RCC_RESET)
    I2C_TypeDef *i2c = get_periph(i2c_num);
    if (i2c_num == I2C_NUM_1)
    {
        RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C1, ENABLE);
        RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C1, DISABLE);
    }
    else
    {
        RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C2, ENABLE);
        RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C2, DISABLE);
    }
    I2C_Cmd(i2c, ENABLE);
#endif
}

/* ========================== 初始化函数 ========================== */

int bsp_i2c_init(i2c_num_t i2c_num, const bsp_i2c_config_t *init_cfg)
{
    if (i2c_num >= I2C_NUM_MAX || init_cfg == NULL)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    const i2c_hw_config_t *hw = &i2c_hw_config[i2c_num];
    I2C_TypeDef *i2c = get_periph(i2c_num);

    // 保存配置
    hi2c->Instance = i2c;
    hi2c->Mode = init_cfg->mode;
    hi2c->State = I2C_STATE_IDLE;
    hi2c->ErrorCode = I2C_OK;

    // 使能时钟
    RCC_APB2PeriphClockCmd(hw->rcc_gpio_clk, ENABLE);
    RCC_APB1PeriphClockCmd(hw->rcc_i2c_clk, ENABLE);

    // 配置 GPIO
    GPIO_InitTypeDef gpio_init = {0};
    gpio_init.GPIO_Pin = hw->scl_pin | hw->sda_pin;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init.GPIO_Mode = GPIO_Mode_AF_OD;
    GPIO_Init(hw->gpio_port, &gpio_init);

    // 重映射配置（如果需要）
    if (i2c_num == I2C_NUM_1 && hw->remap_config != 0)
    {
        GPIO_PinRemapConfig(hw->remap_config, ENABLE);
    }

    // 配置 I2C
    I2C_InitTypeDef i2c_init = {0};
    I2C_StructInit(&i2c_init);
    i2c_init.I2C_ClockSpeed = init_cfg->clock_speed;
    i2c_init.I2C_DutyCycle = init_cfg->duty_cycle;
    i2c_init.I2C_OwnAddress1 = init_cfg->own_address;
    i2c_init.I2C_Ack = init_cfg->enable_ack ? I2C_Ack_Enable : I2C_Ack_Disable;
    i2c_init.I2C_AcknowledgedAddress = init_cfg->is_7_bit_address ? I2C_AcknowledgedAddress_7bit : I2C_AcknowledgedAddress_10bit;

    I2C_Init(i2c, &i2c_init);
    I2C_Cmd(i2c, ENABLE);

    // 配置中断（如果使能中断模式）
    if (init_cfg->mode == I2C_MODE_IT || init_cfg->mode == I2C_MODE_DMA)
    {
        NVIC_InitTypeDef nvic_init = {0};

        if (i2c_num == I2C_NUM_1)
        {
            nvic_init.NVIC_IRQChannel = I2C1_EV_IRQn;
            nvic_init.NVIC_IRQChannelPreemptionPriority = 1;
            nvic_init.NVIC_IRQChannelSubPriority = 0;
            nvic_init.NVIC_IRQChannelCmd = ENABLE;
            NVIC_Init(&nvic_init);

