Fireflyluo/CH32V208_dome/ch32v208_tmos_cdc3/bsp/src/drv_i2c.c
    // 发送寄存器地址
    ret = wait_flag(i2c, I2C_FLAG_TXE, SET, timeout);
    if (ret != I2C_OK)
        goto error;
    I2C_SendData(i2c, reg);

    // 发送数据
    for (uint16_t i = 0; i < len; i++)
    {
        ret = wait_flag(i2c, I2C_FLAG_TXE, SET, timeout);
        if (ret != I2C_OK)
            goto error;
        I2C_SendData(i2c, data[i]);
    }

    // 等待传输完成
    ret = wait_event(i2c, I2C_EVENT_MASTER_BYTE_TRANSMITTED, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送 STOP
    I2C_GenerateSTOP(i2c, ENABLE);

    hi2c->State = I2C_STATE_IDLE;
    return I2C_OK;

error:
    if (ret == I2C_ERR_TIMEOUT)
    {
        i2c_recover_bus(i2c_num);
    }
    i2c_error_handler(hi2c, (uint32_t)ret);
    return ret;
}

int bsp_i2c_read_register_polling(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                                  uint8_t *data, uint16_t len, uint32_t timeout)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    int ret;

    // 先写寄存器地址
    ret = bsp_i2c_write_polling(i2c_num, dev_addr, &reg, 1, timeout);
    if (ret != I2C_OK)
        return ret;

    // 再读数据
    return bsp_i2c_read_polling(i2c_num, dev_addr, data, len, timeout);
}

/* ========================== 中断模式函数 ========================== */

int bsp_i2c_write_it(i2c_num_t i2c_num, uint8_t dev_addr, const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    // 配置传输参数
    hi2c->DevAddr = dev_addr;
    hi2c->pTxBuffer = (uint8_t *)data;
    hi2c->TxLength = len;
    hi2c->TxCount = 0;
    hi2c->RxLength = 0;
    hi2c->IsRegWrite = false;
    hi2c->State = I2C_STATE_BUSY_TX;
    hi2c->ErrorCode = I2C_OK;

    I2C_ITConfig(i2c, I2C_IT_BUF, ENABLE);
    // 启动传输
    I2C_GenerateSTART(i2c, ENABLE);

    return I2C_OK;
}

int bsp_i2c_read_it(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    // 配置传输参数
    hi2c->DevAddr = dev_addr;
    hi2c->pRxBuffer = data;
    hi2c->RxLength = len;
    hi2c->RxCount = 0;
    hi2c->TxLength = 0;
    hi2c->IsRegWrite = false;
    hi2c->State = I2C_STATE_BUSY_RX;
    hi2c->ErrorCode = I2C_OK;

    I2C_ITConfig(i2c, I2C_IT_BUF, ENABLE);
    // 如果是单字节接收，提前禁用 ACK
    if (len == 1)
    {
        I2C_AcknowledgeConfig(i2c, DISABLE);
    }

    // 启动传输
    I2C_GenerateSTART(i2c, ENABLE);

    return I2C_OK;
}

int bsp_i2c_write_register_it(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                              const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0 || len > I2C_MAX_WRITE_LEN - 1)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    // 使用内部缓冲区构造数据（寄存器地址 + 数据）
    static uint8_t tx_buf[I2C_NUM_MAX][I2C_MAX_WRITE_LEN];
    tx_buf[i2c_num][0] = reg;
    memcpy(&tx_buf[i2c_num][1], data, len);

    // 配置传输参数
    hi2c->DevAddr = dev_addr;
    hi2c->pTxBuffer = tx_buf[i2c_num];
    hi2c->TxLength = len + 1;
    hi2c->TxCount = 0;
    hi2c->RxLength = 0;
    hi2c->IsRegWrite = false;
    hi2c->State = I2C_STATE_BUSY_TX;
    hi2c->ErrorCode = I2C_OK;

    I2C_ITConfig(i2c, I2C_IT_BUF, ENABLE);
    // 启动传输
    I2C_GenerateSTART(i2c, ENABLE);

    return I2C_OK;
}

int bsp_i2c_read_register_it(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                             uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    // 配置传输参数（先写寄存器地址，再读）
    hi2c->DevAddr = dev_addr;
    hi2c->RegAddr = reg;
    hi2c->pRxBuffer = data;
    hi2c->RxLength = len;
    hi2c->RxCount = 0;
    hi2c->TxLength = 1;
    hi2c->TxCount = 0;
    hi2c->IsRegWrite = true;
    hi2c->State = I2C_STATE_BUSY_TX;
    hi2c->ErrorCode = I2C_OK;

    I2C_ITConfig(i2c, I2C_IT_BUF, ENABLE);
    // 启动传输
    I2C_GenerateSTART(i2c, ENABLE);

    return I2C_OK;
}

/* ========================== DMA 模式函数 ========================== */

void bsp_i2c_dma_init(i2c_num_t i2c_num, DMA_Channel_TypeDef *tx_channel, DMA_Channel_TypeDef *rx_channel)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);

    hi2c->TxDmaChannel = tx_channel;
    hi2c->RxDmaChannel = rx_channel;
    hi2c->DmaEnabled = (tx_channel != NULL) || (rx_channel != NULL);

    // 使能 DMA 时钟
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
}

static void i2c_dma_config(DMA_Channel_TypeDef *channel, uint32_t periph_addr,
                           uint32_t mem_addr, uint16_t size, uint32_t direction)
{
    DMA_InitTypeDef dma_init = {0};
    DMA_StructInit(&dma_init);

    dma_init.DMA_PeripheralBaseAddr = periph_addr;
    dma_init.DMA_MemoryBaseAddr = mem_addr;
    dma_init.DMA_DIR = direction;
    dma_init.DMA_BufferSize = size;
    dma_init.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_init.DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma_init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_init.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    dma_init.DMA_Mode = DMA_Mode_Normal;
    dma_init.DMA_Priority = DMA_Priority_High;
    dma_init.DMA_M2M = DMA_M2M_Disable;

    DMA_Init(channel, &dma_init);
}

int bsp_i2c_write_dma(i2c_num_t i2c_num, uint8_t dev_addr, const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

