Fireflyluo/CH32V208_dome/ch32v208_tmos_cdc3/bsp/src/drv_i2c.c
    if (!hi2c->DmaEnabled || hi2c->TxDmaChannel == NULL)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    // 配置 DMA
    i2c_dma_config(hi2c->TxDmaChannel, (uint32_t)&i2c->DATAR,
                   (uint32_t)data, len, DMA_DIR_PeripheralDST);

    // 配置传输参数
    hi2c->DevAddr = dev_addr;
    hi2c->pTxBuffer = (uint8_t *)data;
    hi2c->TxLength = len;
    hi2c->TxCount = 0;
    hi2c->RxLength = 0;
    hi2c->State = I2C_STATE_BUSY_TX;
    hi2c->ErrorCode = I2C_OK;

    // 使能 DMA 中断
    DMA_ITConfig(hi2c->TxDmaChannel, DMA_IT_TC, ENABLE);

    // 启动 DMA
    DMA_Cmd(hi2c->TxDmaChannel, ENABLE);

    // 启动传输
    I2C_GenerateSTART(i2c, ENABLE);

    return I2C_OK;
}

int bsp_i2c_read_dma(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    if (!hi2c->DmaEnabled || hi2c->RxDmaChannel == NULL)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    // 配置 DMA
    i2c_dma_config(hi2c->RxDmaChannel, (uint32_t)&i2c->DATAR,
                   (uint32_t)data, len, DMA_DIR_PeripheralSRC);

    // 配置传输参数
    hi2c->DevAddr = dev_addr;
    hi2c->pRxBuffer = data;
    hi2c->RxLength = len;
    hi2c->RxCount = 0;
    hi2c->TxLength = 0;
    hi2c->State = I2C_STATE_BUSY_RX;
    hi2c->ErrorCode = I2C_OK;

    // 如果是单字节接收，提前禁用 ACK
    if (len == 1)
    {
        I2C_AcknowledgeConfig(i2c, DISABLE);
    }

    // 使能 DMA 中断
    DMA_ITConfig(hi2c->RxDmaChannel, DMA_IT_TC, ENABLE);

    // 启动 DMA
    DMA_Cmd(hi2c->RxDmaChannel, ENABLE);

    // 启动传输
    I2C_GenerateSTART(i2c, ENABLE);

    return I2C_OK;
}

int bsp_i2c_write_register_dma(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                               const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0 || len > I2C_MAX_WRITE_LEN - 1)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    // 使用内部缓冲区构造数据
    static uint8_t tx_buf[I2C_NUM_MAX][I2C_MAX_WRITE_LEN];
    tx_buf[i2c_num][0] = reg;
    memcpy(&tx_buf[i2c_num][1], data, len);

    return bsp_i2c_write_dma(i2c_num, dev_addr, tx_buf[i2c_num], len + 1);
}

int bsp_i2c_read_register_dma(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                              uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    // 对于 DMA 模式，先使用中断模式发送寄存器地址，然后使用 DMA 接收数据
    // 这里简化为先用轮询发送寄存器地址
    int ret = bsp_i2c_write_polling(i2c_num, dev_addr, &reg, 1, I2C_TIMEOUT_DEFAULT);
    if (ret != I2C_OK)
        return ret;

    return bsp_i2c_read_dma(i2c_num, dev_addr, data, len);
}

/* ========================== 简化接口 ========================== */

int bsp_i2c_write(i2c_num_t i2c_num, uint8_t dev_addr, const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    uint8_t mode = get_handle(i2c_num)->Mode;

    switch (mode)
    {
    case I2C_MODE_POLLING:
        return bsp_i2c_write_polling(i2c_num, dev_addr, data, len, I2C_TIMEOUT_DEFAULT);
    case I2C_MODE_IT:
        return bsp_i2c_write_it(i2c_num, dev_addr, data, len);
    case I2C_MODE_DMA:
        return bsp_i2c_write_dma(i2c_num, dev_addr, data, len);
    default:
        return I2C_ERR_INVALID_PARAM;
    }
}

int bsp_i2c_read(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    uint8_t mode = get_handle(i2c_num)->Mode;

    switch (mode)
    {
    case I2C_MODE_POLLING:
        return bsp_i2c_read_polling(i2c_num, dev_addr, data, len, I2C_TIMEOUT_DEFAULT);
    case I2C_MODE_IT:
        return bsp_i2c_read_it(i2c_num, dev_addr, data, len);
    case I2C_MODE_DMA:
        return bsp_i2c_read_dma(i2c_num, dev_addr, data, len);
    default:
        return I2C_ERR_INVALID_PARAM;
    }
}

int bsp_i2c_write_register(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                           const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    uint8_t mode = get_handle(i2c_num)->Mode;

    switch (mode)
    {
    case I2C_MODE_POLLING:
        return bsp_i2c_write_register_polling(i2c_num, dev_addr, reg, data, len, I2C_TIMEOUT_DEFAULT);
    case I2C_MODE_IT:
        return bsp_i2c_write_register_it(i2c_num, dev_addr, reg, data, len);
    case I2C_MODE_DMA:
        return bsp_i2c_write_register_dma(i2c_num, dev_addr, reg, data, len);
    default:
        return I2C_ERR_INVALID_PARAM;
    }
}

int bsp_i2c_read_register(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                          uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    uint8_t mode = get_handle(i2c_num)->Mode;

    switch (mode)
    {
    case I2C_MODE_POLLING:
        return bsp_i2c_read_register_polling(i2c_num, dev_addr, reg, data, len, I2C_TIMEOUT_DEFAULT);
    case I2C_MODE_IT:
        return bsp_i2c_read_register_it(i2c_num, dev_addr, reg, data, len);
    case I2C_MODE_DMA:
        return bsp_i2c_read_register_dma(i2c_num, dev_addr, reg, data, len);
    default:
        return I2C_ERR_INVALID_PARAM;
    }
}

int bsp_i2c_write_byte(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg, uint8_t data)
{
    return bsp_i2c_write_register(i2c_num, dev_addr, reg, &data, 1);
}

int bsp_i2c_read_byte(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg, uint8_t *data)
{
    return bsp_i2c_read_register(i2c_num, dev_addr, reg, data, 1);
}

/* ========================== 设备探测 ========================== */

int bsp_i2c_check_device(i2c_num_t i2c_num, uint8_t dev_addr, uint32_t timeout)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

