Fireflyluo/CH32V208_dome/ch32v208_tmos_cdc3/bsp/src/drv_i2c.c
    I2C_TypeDef *i2c = get_periph(i2c_num);
    int ret;

    // 等待总线空闲
    ret = wait_flag(i2c, I2C_FLAG_BUSY, RESET, timeout);
    if (ret != I2C_OK)
        return ret;

    // 发送 START
    I2C_GenerateSTART(i2c, ENABLE);
    ret = wait_event(i2c, I2C_EVENT_MASTER_MODE_SELECT, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送地址
    I2C_Send7bitAddress(i2c, dev_addr << 1, I2C_Direction_Transmitter);

    // 等待 ACK
    ret = wait_event(i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, timeout);

error:
    // 发送 STOP
    I2C_GenerateSTOP(i2c, ENABLE);

    return (ret == I2C_OK) ? I2C_OK : I2C_ERR_AF;
}

uint8_t bsp_i2c_scan(i2c_num_t i2c_num, uint8_t *found_addr, uint8_t max_count)
{
    if (i2c_num >= I2C_NUM_MAX || found_addr == NULL || max_count == 0)
    {
        return 0;
    }

    uint8_t count = 0;

    // 扫描 0x08 - 0x77 范围内的地址
    for (uint8_t addr = 0x08; addr <= 0x77 && count < max_count; addr++)
    {
        if (bsp_i2c_check_device(i2c_num, addr, 1000) == I2C_OK)
        {
            found_addr[count++] = addr;
        }
    }

    return count;
}

/* ========================== 回调函数注册 ========================== */

void bsp_i2c_register_tx_callback(i2c_num_t i2c_num, bsp_i2c_callback_t callback)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;
    get_handle(i2c_num)->TxCpltCallback = callback;
}

void bsp_i2c_register_rx_callback(i2c_num_t i2c_num, bsp_i2c_callback_t callback)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;
    get_handle(i2c_num)->RxCpltCallback = callback;
}

void bsp_i2c_register_error_callback(i2c_num_t i2c_num, bsp_i2c_error_callback_t callback)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;
    get_handle(i2c_num)->ErrorCallback = callback;
}

/* ========================== 中断处理 ========================== */

static void i2c_ev_handler(I2C_HandleTypeDef *hi2c, i2c_num_t num)
{
    I2C_TypeDef *i2c = hi2c->Instance;

    if (hi2c->State == I2C_STATE_IDLE)
    {
        I2C_ITConfig(i2c, I2C_IT_BUF, DISABLE);
        return;
    }

    // 1. SB - START 条件已发送
    if (I2C_GetITStatus(i2c, I2C_IT_SB))
    {
        if (hi2c->IsRegWrite && hi2c->RxLength > 0)
        {
            // 寄存器读操作，先写寄存器地址
            I2C_Send7bitAddress(i2c, hi2c->DevAddr << 1, I2C_Direction_Transmitter);
        }
        else if (hi2c->RxLength > 0)
        {
            // 直接读
            I2C_Send7bitAddress(i2c, hi2c->DevAddr << 1, I2C_Direction_Receiver);
        }
        else
        {
            // 写操作
            I2C_Send7bitAddress(i2c, hi2c->DevAddr << 1, I2C_Direction_Transmitter);
        }
    }
    // 2. ADDR - 地址已发送
    else if (I2C_GetITStatus(i2c, I2C_IT_ADDR))
    {
        // 清除 ADDR 标志
        __IO uint32_t tmp = i2c->STAR1;
        tmp = i2c->STAR2;
        (void)tmp;

        // 如果是接收模式且只剩1字节，提前禁用 ACK
        if (hi2c->RxLength == 1 && !hi2c->IsRegWrite)
        {
            I2C_AcknowledgeConfig(i2c, DISABLE);
        }
    }
    // 3. BTF - 当前字节真正发送完成，用于收尾或重复起始
    else if (I2C_GetITStatus(i2c, I2C_IT_BTF))
    {
        if (hi2c->State == I2C_STATE_BUSY_TX && hi2c->TxCount >= hi2c->TxLength)
        {
            if (hi2c->IsRegWrite && hi2c->RxLength > 0)
            {
                hi2c->IsRegWrite = false;
                hi2c->State = I2C_STATE_BUSY_RX;
                if (hi2c->RxLength == 1)
                {
                    I2C_AcknowledgeConfig(i2c, DISABLE);
                }
                I2C_GenerateSTART(i2c, ENABLE);
            }
            else
            {
                I2C_GenerateSTOP(i2c, ENABLE);
                I2C_ITConfig(i2c, I2C_IT_BUF, DISABLE);
                hi2c->State = I2C_STATE_IDLE;

                if (hi2c->TxCpltCallback)
                {
                    hi2c->TxCpltCallback(num);
                }
            }
        }
    }
    // 4. TXE - 发送缓冲区空，只负责继续喂数据
    else if (I2C_GetITStatus(i2c, I2C_IT_TXE))
    {
        if (hi2c->TxCount < hi2c->TxLength)
        {
            if (hi2c->IsRegWrite && hi2c->TxCount == 0)
            {
                // 发送寄存器地址
                I2C_SendData(i2c, hi2c->RegAddr);
            }
            else
            {
                I2C_SendData(i2c, hi2c->pTxBuffer[hi2c->TxCount]);
            }
            hi2c->TxCount++;
        }
    }
    // 5. RXNE - 接收缓冲区非空
    else if (I2C_GetITStatus(i2c, I2C_IT_RXNE))
    {
        if (hi2c->RxCount < hi2c->RxLength)
        {
            hi2c->pRxBuffer[hi2c->RxCount++] = I2C_ReceiveData(i2c);

            if (hi2c->RxCount == hi2c->RxLength - 1)
            {
                // 下一个字节是最后一个，禁用 ACK
                I2C_AcknowledgeConfig(i2c, DISABLE);
            }
            else if (hi2c->RxCount >= hi2c->RxLength)
            {
                // 接收完成
                I2C_GenerateSTOP(i2c, ENABLE);
                I2C_AcknowledgeConfig(i2c, ENABLE);
                I2C_ITConfig(i2c, I2C_IT_BUF, DISABLE);
                hi2c->State = I2C_STATE_IDLE;

                if (hi2c->RxCpltCallback)
                {
                    hi2c->RxCpltCallback(num);
                }
            }
        }
    }
}

static void i2c_er_handler(I2C_HandleTypeDef *hi2c, i2c_num_t num)
{
    I2C_TypeDef *i2c = hi2c->Instance;
    uint32_t error = I2C_OK;

    // 检查错误标志
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_AF))
    {
        I2C_ClearFlag(i2c, I2C_FLAG_AF);
        error = I2C_ERR_AF;
    }
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_BERR))
    {
        I2C_ClearFlag(i2c, I2C_FLAG_BERR);
        error = I2C_ERR_BERR;
    }
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_ARLO))
    {
        I2C_ClearFlag(i2c, I2C_FLAG_ARLO);
        error = I2C_ERR_ARLO;
    }
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_OVR))
    {
        I2C_ClearFlag(i2c, I2C_FLAG_OVR);
        error = I2C_ERR_DMA;
    }

    if (error != I2C_OK)
    {
        i2c_error_handler(hi2c, error);
    }
}

void bsp_i2c_irq_handler(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = hi2c->Instance;

    // 事件中断
    if (I2C_GetITStatus(i2c, I2C_IT_SB) ||
        I2C_GetITStatus(i2c, I2C_IT_ADDR) ||
        I2C_GetITStatus(i2c, I2C_IT_TXE) ||
        I2C_GetITStatus(i2c, I2C_IT_RXNE) ||
        I2C_GetITStatus(i2c, I2C_IT_BTF))
    {
        i2c_ev_handler(hi2c, i2c_num);
    }

