Fireflyluo/CH32V208_dome/ch32v208_tmos_cdc3/bsp/src/drv_i2c.c
    // 错误中断：只在真实错误标志出现时处理，避免调试时反复误入
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_AF) ||
        I2C_GetFlagStatus(i2c, I2C_FLAG_BERR) ||
        I2C_GetFlagStatus(i2c, I2C_FLAG_ARLO) ||
        I2C_GetFlagStatus(i2c, I2C_FLAG_OVR))
    {
        i2c_er_handler(hi2c, i2c_num);
    }
}

void bsp_i2c_dma_tx_irq_handler(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = hi2c->Instance;
    DMA_Channel_TypeDef *channel = hi2c->TxDmaChannel;

    if (DMA_GetITStatus(DMA1_IT_TC1 + ((uint32_t)channel - (uint32_t)DMA1_Channel1) / 20))
    {
        DMA_ClearITPendingBit(DMA1_IT_TC1 + ((uint32_t)channel - (uint32_t)DMA1_Channel1) / 20);
        DMA_Cmd(channel, DISABLE);

        // 等待 BTF
        while (!I2C_GetFlagStatus(i2c, I2C_FLAG_BTF))
            ;

        // 发送 STOP
        I2C_GenerateSTOP(i2c, ENABLE);
        I2C_DMACmd(i2c, DISABLE);

        hi2c->State = I2C_STATE_IDLE;

        if (hi2c->TxCpltCallback)
        {
            hi2c->TxCpltCallback(i2c_num);
        }
    }
}

void bsp_i2c_dma_rx_irq_handler(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = hi2c->Instance;
    DMA_Channel_TypeDef *channel = hi2c->RxDmaChannel;

    if (DMA_GetITStatus(DMA1_IT_TC1 + ((uint32_t)channel - (uint32_t)DMA1_Channel1) / 20))
    {
        DMA_ClearITPendingBit(DMA1_IT_TC1 + ((uint32_t)channel - (uint32_t)DMA1_Channel1) / 20);
        DMA_Cmd(channel, DISABLE);

        // 发送 STOP
        I2C_GenerateSTOP(i2c, ENABLE);
        I2C_AcknowledgeConfig(i2c, ENABLE);
        I2C_DMACmd(i2c, DISABLE);

        hi2c->State = I2C_STATE_IDLE;

        if (hi2c->RxCpltCallback)
        {
            hi2c->RxCpltCallback(i2c_num);
        }
    }
}

/* ========================== 弱定义回调 ========================== */

__attribute__((weak)) void bsp_i2c1_tx_cplt_callback(void)
{
}
__attribute__((weak)) void bsp_i2c1_rx_cplt_callback(void)
{
}
__attribute__((weak)) void bsp_i2c1_error_callback(uint32_t error_code)
{
    (void)error_code;
}
__attribute__((weak)) void bsp_i2c2_tx_cplt_callback(void)
{
}
__attribute__((weak)) void bsp_i2c2_rx_cplt_callback(void)
{
}
__attribute__((weak)) void bsp_i2c2_error_callback(uint32_t error_code)
{
    (void)error_code;
}
